# ResList_Filter

## Description
Set a filter for resource in active document. The 'uniqueID' is a string identifier uniquely identifying this control.

```pascal
PROCEDURE ResList_Filter(
				uniqueID : STRING;
				callback : PROCEDURE);
```

```python
def vs.ResList_Filter(uniqueID, callback):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|uniqueID|STRING|   |
|callback|PROCEDURE|   |

## Version
Availability: from Vectorworks 2020

## Category
* Document List Handling